"""
Задача 3.
Непрерывная случайная величина X распределена нормально и задана плотностью распределения
f(x) = (1 / (4 * sqrt(2pi))) * exp((-(x+2)**2) / 32)
Найдите:
а). M(X)
б). D(X)
в). Std(X) (среднее квадратичное отклонение)
"""
import math

# Параметры нормального распределения из плотности распределения
mu = -2  # математическое ожидание M(X)
variance = 32  # дисперсия D(X)
std_dev = math.sqrt(variance)  # стандартное отклонение Std(X)

print(f"M(X) (математическое ожидание): {mu}")
print(f"D(X) (дисперсия): {variance}")
print(f"Std(X) (стандартное отклонение): {std_dev}")
