"""
Задача 5.
На сколько сигм (средних квадратичных отклонений) отклоняется рост человека, равный 190 см,
от математического ожидания роста в популяции, в которой M(X) = 178 см и D(X) = 25 кв.см?
"""
import math

X = 190  # рост человека
mu = 178  # математическое ожидание
D_X = 25  # дисперсия

# Вычисляем среднеквадратичное отклонение
sigma = math.sqrt(D_X)

# Находим Z-оценку
Z = (X - mu) / sigma
print(f"Человек с ростом 190 см отклоняется от математического ожидания на {Z} сигм")
