"""
Задача 1.
Случайная непрерывная величина A имеет равномерное распределение на промежутке (200, 800].
Найдите ее среднее значение и дисперсию.
"""
a = 200
b = 800

# Среднее значение
mean_value = (a + b) / 2

# Дисперсия
variance = ((b - a) ** 2) / 12

print(f"Среднее значение: {mean_value}")
print(f"Дисперсия: {variance}")
